wolfSSL/wolfHAL/src/crypto/stm32n6_cryp.c
/* stm32n6_cryp.c
 *
 * Copyright (C) 2026 wolfSSL Inc.
 *
 * This file is part of wolfHAL.
 *
 * wolfHAL is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 3 of the License, or
 * (at your option) any later version.
 *
 * wolfHAL is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1335, USA
 */

#include <stdint.h>
#include "wolfHAL_board.h"  /* provides WHAL_CFG_STM32N6_CRYP*_DEV initializers */
#include <wolfHAL/crypto/stm32n6_cryp.h>
#include <wolfHAL/crypto/crypto.h>
#include <wolfHAL/error.h>
#include <wolfHAL/reg.h>
#include <wolfHAL/bitops.h>
#include <wolfHAL/endian.h>

const whal_Crypto  whal_Stm32n6_Cryp_Dev      = WHAL_CFG_STM32N6_CRYP_DEV;
const whal_AesEcb  whal_Stm32n6_CrypEcb_Dev   = WHAL_CFG_STM32N6_CRYP_ECB_DEV;
const whal_AesCbc  whal_Stm32n6_CrypCbc_Dev   = WHAL_CFG_STM32N6_CRYP_CBC_DEV;
const whal_AesCtr  whal_Stm32n6_CrypCtr_Dev   = WHAL_CFG_STM32N6_CRYP_CTR_DEV;
const whal_AesGcm  whal_Stm32n6_CrypGcm_Dev   = WHAL_CFG_STM32N6_CRYP_GCM_DEV;
const whal_AesGmac whal_Stm32n6_CrypGmac_Dev  = WHAL_CFG_STM32N6_CRYP_GMAC_DEV;
const whal_AesCcm  whal_Stm32n6_CrypCcm_Dev   = WHAL_CFG_STM32N6_CRYP_CCM_DEV;

/* Control Register (CRYP_CR) */
#define CRYP_CR_REG            0x00
#define CRYP_CR_ALGODIR_Pos    2
#define CRYP_CR_ALGODIR_Msk    (1UL << CRYP_CR_ALGODIR_Pos)
#define CRYP_CR_ALGOMODE_LO_Pos 3
#define CRYP_CR_ALGOMODE_LO_Msk (7UL << CRYP_CR_ALGOMODE_LO_Pos)
#define CRYP_CR_DATATYPE_Pos   6
#define CRYP_CR_DATATYPE_Msk   (3UL << CRYP_CR_DATATYPE_Pos)
#define CRYP_CR_KEYSIZE_Pos    8
#define CRYP_CR_KEYSIZE_Msk    (3UL << CRYP_CR_KEYSIZE_Pos)
#define CRYP_CR_FFLUSH_Pos     14
#define CRYP_CR_FFLUSH_Msk     (1UL << CRYP_CR_FFLUSH_Pos)
#define CRYP_CR_CRYPEN_Pos     15
#define CRYP_CR_CRYPEN_Msk     (1UL << CRYP_CR_CRYPEN_Pos)
#define CRYP_CR_GCM_CCMPH_Pos  16
#define CRYP_CR_GCM_CCMPH_Msk  (3UL << CRYP_CR_GCM_CCMPH_Pos)
#define CRYP_CR_ALGOMODE_HI_Pos 19
#define CRYP_CR_ALGOMODE_HI_Msk (1UL << CRYP_CR_ALGOMODE_HI_Pos)
#define CRYP_CR_NPBLB_Pos      20
#define CRYP_CR_NPBLB_Msk      (0xFUL << CRYP_CR_NPBLB_Pos)
#define CRYP_CR_KMOD_Pos       24
#define CRYP_CR_KMOD_Msk       (3UL << CRYP_CR_KMOD_Pos)
#define CRYP_CR_IPRST_Pos      31
#define CRYP_CR_IPRST_Msk      (1UL << CRYP_CR_IPRST_Pos)

#define CRYP_CR_ALGOMODE_Msk \
    (CRYP_CR_ALGOMODE_LO_Msk | CRYP_CR_ALGOMODE_HI_Msk)

/* Pack a 4-bit ALGOMODE into the split CR bitfields (bits 5:3 + bit 19). */
#define CRYP_CR_ALGOMODE(v) \
    ((((uint32_t)(v) & 0x7U) << CRYP_CR_ALGOMODE_LO_Pos) | \
     ((((uint32_t)(v) >> 3) & 0x1U) << CRYP_CR_ALGOMODE_HI_Pos))

/* ALGOMODE values */
#define CRYP_ALGOMODE_AES_ECB     0x4
#define CRYP_ALGOMODE_AES_CBC     0x5
#define CRYP_ALGOMODE_AES_CTR     0x6
#define CRYP_ALGOMODE_AES_KEYPREP 0x7
#define CRYP_ALGOMODE_AES_GCM     0x8
#define CRYP_ALGOMODE_AES_CCM     0x9

#define CRYP_ALGODIR_ENCRYPT 0
#define CRYP_ALGODIR_DECRYPT 1

#define CRYP_KEYSIZE_128 0
#define CRYP_KEYSIZE_192 1
#define CRYP_KEYSIZE_256 2

#define CRYP_GCM_CCMPH_INIT    0
#define CRYP_GCM_CCMPH_HEADER  1
#define CRYP_GCM_CCMPH_PAYLOAD 2
#define CRYP_GCM_CCMPH_FINAL   3

/* Status Register (CRYP_SR) */
#define CRYP_SR_REG            0x04
#define CRYP_SR_IFEM_Msk       (1UL << 0)
#define CRYP_SR_IFNF_Msk       (1UL << 1)
#define CRYP_SR_OFNE_Msk       (1UL << 2)
#define CRYP_SR_OFFU_Msk       (1UL << 3)
#define CRYP_SR_BUSY_Msk       (1UL << 4)
#define CRYP_SR_KERF_Msk       (1UL << 6)
#define CRYP_SR_KEYVALID_Msk   (1UL << 7)

/* Data Registers */
#define CRYP_DINR_REG          0x08
#define CRYP_DOUTR_REG         0x0C

/* Key Registers (write-only): K0LR..K3RR at 0x20..0x3C */
#define CRYP_K0LR_REG          0x20
#define CRYP_K0RR_REG          0x24
#define CRYP_K1LR_REG          0x28
#define CRYP_K1RR_REG          0x2C
#define CRYP_K2LR_REG          0x30
#define CRYP_K2RR_REG          0x34
#define CRYP_K3LR_REG          0x38
#define CRYP_K3RR_REG          0x3C

/* Initialization Vector Registers: IV0LR..IV1RR at 0x40..0x4C */
#define CRYP_IV0LR_REG         0x40
#define CRYP_IV0RR_REG         0x44
#define CRYP_IV1LR_REG         0x48
#define CRYP_IV1RR_REG         0x4C

/* Per-driver state surviving Start→Finalize. Singleton drivers so static. */
static whal_Stm32n6_AesGcm_State g_aesGcmState;
static whal_Stm32n6_AesCcm_State g_aesCcmState;

static whal_Error WaitKeyValid(size_t base, whal_Timeout *timeout)
{
    return whal_Reg_ReadPoll(base, CRYP_SR_REG, CRYP_SR_KEYVALID_Msk,
                             CRYP_SR_KEYVALID_Msk, timeout);
}

static whal_Error WaitBusyClear(size_t base, whal_Timeout *timeout)
{
    return whal_Reg_ReadPoll(base, CRYP_SR_REG, CRYP_SR_BUSY_Msk, 0, timeout);
}

static whal_Error WaitCrypEnClear(size_t base, whal_Timeout *timeout)
{
    return whal_Reg_ReadPoll(base, CRYP_CR_REG, CRYP_CR_CRYPEN_Msk, 0, timeout);
}

static whal_Error WaitOutputReady(size_t base, whal_Timeout *timeout)
{
    return whal_Reg_ReadPoll(base, CRYP_SR_REG, CRYP_SR_OFNE_Msk,
                             CRYP_SR_OFNE_Msk, timeout);
}

static void DisableAndFlush(size_t base)
{
    whal_Reg_Update(base, CRYP_CR_REG, CRYP_CR_CRYPEN_Msk, 0);
    whal_Reg_Update(base, CRYP_CR_REG, CRYP_CR_FFLUSH_Msk, CRYP_CR_FFLUSH_Msk);
}

static void Enable(size_t base)
{
    whal_Reg_Update(base, CRYP_CR_REG, CRYP_CR_CRYPEN_Msk, CRYP_CR_CRYPEN_Msk);
}

static void Disable(size_t base)
{
    whal_Reg_Update(base, CRYP_CR_REG, CRYP_CR_CRYPEN_Msk, 0);
}

/*
 * Write the AES key into CRYP_KxL/R registers in the order required by the
 * hardware key scheduler: high-order 32-bit words first, descending into the
 * low 32 bits (K3RR last). The key is read big-endian from the input buffer.
 */
static void WriteKey(size_t base, const uint8_t *key, size_t keySz)
{
    const uint8_t *k = key;

