wolfSSL/wolfHAL/src/crypto/stm32n6_cryp.c
    if (keySz == 32) {
        whal_Reg_Write(base, CRYP_K0LR_REG, whal_LoadBe32(k));
        whal_Reg_Write(base, CRYP_K0RR_REG, whal_LoadBe32(k + 4));
        whal_Reg_Write(base, CRYP_K1LR_REG, whal_LoadBe32(k + 8));
        whal_Reg_Write(base, CRYP_K1RR_REG, whal_LoadBe32(k + 12));
        k += 16;
    } else if (keySz == 24) {
        whal_Reg_Write(base, CRYP_K1LR_REG, whal_LoadBe32(k));
        whal_Reg_Write(base, CRYP_K1RR_REG, whal_LoadBe32(k + 4));
        k += 8;
    }
    whal_Reg_Write(base, CRYP_K2LR_REG, whal_LoadBe32(k));
    whal_Reg_Write(base, CRYP_K2RR_REG, whal_LoadBe32(k + 4));
    whal_Reg_Write(base, CRYP_K3LR_REG, whal_LoadBe32(k + 8));
    whal_Reg_Write(base, CRYP_K3RR_REG, whal_LoadBe32(k + 12));
}

static void WriteIv16(size_t base, const uint8_t *iv)
{
    whal_Reg_Write(base, CRYP_IV0LR_REG, whal_LoadBe32(iv));
    whal_Reg_Write(base, CRYP_IV0RR_REG, whal_LoadBe32(iv + 4));
    whal_Reg_Write(base, CRYP_IV1LR_REG, whal_LoadBe32(iv + 8));
    whal_Reg_Write(base, CRYP_IV1RR_REG, whal_LoadBe32(iv + 12));
}

static void ZeroKeyIv(size_t base)
{
    whal_Reg_Write(base, CRYP_K0LR_REG, 0);
    whal_Reg_Write(base, CRYP_K0RR_REG, 0);
    whal_Reg_Write(base, CRYP_K1LR_REG, 0);
    whal_Reg_Write(base, CRYP_K1RR_REG, 0);
    whal_Reg_Write(base, CRYP_K2LR_REG, 0);
    whal_Reg_Write(base, CRYP_K2RR_REG, 0);
    whal_Reg_Write(base, CRYP_K3LR_REG, 0);
    whal_Reg_Write(base, CRYP_K3RR_REG, 0);
    whal_Reg_Write(base, CRYP_IV0LR_REG, 0);
    whal_Reg_Write(base, CRYP_IV0RR_REG, 0);
    whal_Reg_Write(base, CRYP_IV1LR_REG, 0);
    whal_Reg_Write(base, CRYP_IV1RR_REG, 0);
}

static void WriteBlock(size_t base, const uint8_t *in)
{
    whal_Reg_Write(base, CRYP_DINR_REG, whal_LoadBe32(in));
    whal_Reg_Write(base, CRYP_DINR_REG, whal_LoadBe32(in + 4));
    whal_Reg_Write(base, CRYP_DINR_REG, whal_LoadBe32(in + 8));
    whal_Reg_Write(base, CRYP_DINR_REG, whal_LoadBe32(in + 12));
}

static void ReadBlock(size_t base, uint8_t *out)
{
    whal_StoreBe32(out,      whal_Reg_Read(base, CRYP_DOUTR_REG));
    whal_StoreBe32(out + 4,  whal_Reg_Read(base, CRYP_DOUTR_REG));
    whal_StoreBe32(out + 8,  whal_Reg_Read(base, CRYP_DOUTR_REG));
    whal_StoreBe32(out + 12, whal_Reg_Read(base, CRYP_DOUTR_REG));
}

/*
 * Configure CR for an AES operation: clears every mode-related field and sets
 * the requested ALGOMODE/ALGODIR/KEYSIZE/KMOD/PHASE/NPBLB. CRYPEN/FFLUSH/IPRST
 * are left untouched.
 */
static void ConfigureMode(size_t base, uint32_t algoMode, uint32_t algoDir,
                          uint32_t keySize, uint32_t phase, uint32_t npblb,
                          uint32_t kmod)
{
    uint32_t mask = CRYP_CR_ALGOMODE_Msk | CRYP_CR_ALGODIR_Msk |
                    CRYP_CR_KEYSIZE_Msk | CRYP_CR_DATATYPE_Msk |
                    CRYP_CR_GCM_CCMPH_Msk | CRYP_CR_NPBLB_Msk |
                    CRYP_CR_KMOD_Msk;
    uint32_t value = CRYP_CR_ALGOMODE(algoMode) |
                     whal_SetBits(CRYP_CR_ALGODIR_Msk, CRYP_CR_ALGODIR_Pos,
                                  algoDir) |
                     whal_SetBits(CRYP_CR_KEYSIZE_Msk, CRYP_CR_KEYSIZE_Pos,
                                  keySize) |
                     whal_SetBits(CRYP_CR_GCM_CCMPH_Msk, CRYP_CR_GCM_CCMPH_Pos,
                                  phase) |
                     whal_SetBits(CRYP_CR_NPBLB_Msk, CRYP_CR_NPBLB_Pos, npblb) |
                     whal_SetBits(CRYP_CR_KMOD_Msk, CRYP_CR_KMOD_Pos, kmod);

    whal_Reg_Update(base, CRYP_CR_REG, mask, value);
}

static whal_Error KeySizeBits(size_t keySz, uint32_t *out)
{
    if (keySz == 16) {
        *out = CRYP_KEYSIZE_128;
    } else if (keySz == 24) {
        *out = CRYP_KEYSIZE_192;
    } else if (keySz == 32) {
        *out = CRYP_KEYSIZE_256;
    } else {
        return WHAL_ENOTSUP;
    }
    return WHAL_SUCCESS;
}

/*
 * Run the ECB/CBC decryption key-preparation pass. Required before performing
 * an ECB or CBC decryption: the hardware computes the last round key, then
 * auto-clears CRYPEN. Caller must hold the timeout and have keys staged.
 */
static whal_Error PrepareDecryptionKey(size_t base, const uint8_t *key,
                                       size_t keySz, uint32_t keySizeBits,
                                       whal_Timeout *timeout)
{
    whal_Error err;

    DisableAndFlush(base);
    ConfigureMode(base, CRYP_ALGOMODE_AES_KEYPREP, CRYP_ALGODIR_ENCRYPT,
                  keySizeBits, 0, 0, 0);
    WriteKey(base, key, keySz);
    err = WaitKeyValid(base, timeout);
    if (err)
        return err;
    Enable(base);
    return WaitCrypEnClear(base, timeout);
}

static whal_Error Process_BlockCipher(const uint8_t *in, uint8_t *out, size_t sz)
{
    const whal_Stm32n6_Cryp_Cfg *cfg =
        (const whal_Stm32n6_Cryp_Cfg *)whal_Stm32n6_Cryp_Dev.cfg;
    size_t base = whal_Stm32n6_Cryp_Dev.base;
    whal_Error err;
    size_t i;

    if (sz == 0)
        return WHAL_SUCCESS;

    if (!in || !out || (sz & 0xF) != 0) {
        Disable(base);
        ZeroKeyIv(base);
        return WHAL_EINVAL;
    }

    for (i = 0; i < sz; i += 16) {
        WriteBlock(base, in + i);
        err = WaitOutputReady(base, cfg->timeout);
        if (err) {
            Disable(base);
            ZeroKeyIv(base);
            return err;
        }
        ReadBlock(base, out + i);
    }

    return WHAL_SUCCESS;
}


/* ---- Direct API mapping ---- */

#ifdef WHAL_CFG_STM32N6_CRYP_INIT_DIRECT_API_MAPPING
#define whal_Stm32n6_Cryp_Init        whal_Crypto_Init
#define whal_Stm32n6_Cryp_Deinit      whal_Crypto_Deinit
#endif
#ifdef WHAL_CFG_STM32N6_CRYP_ECB_DIRECT_API_MAPPING
#define whal_Stm32n6_CrypAesEcb_Oneshot  whal_AesEcb_Oneshot
#define whal_Stm32n6_CrypAesEcb_Start    whal_AesEcb_Start
#define whal_Stm32n6_CrypAesEcb_Process  whal_AesEcb_Process
#endif
#ifdef WHAL_CFG_STM32N6_CRYP_CBC_DIRECT_API_MAPPING
#define whal_Stm32n6_CrypAesCbc_Oneshot  whal_AesCbc_Oneshot
#define whal_Stm32n6_CrypAesCbc_Start    whal_AesCbc_Start
#define whal_Stm32n6_CrypAesCbc_Process  whal_AesCbc_Process
#endif
#ifdef WHAL_CFG_STM32N6_CRYP_CTR_DIRECT_API_MAPPING
#define whal_Stm32n6_CrypAesCtr_Oneshot  whal_AesCtr_Oneshot
#define whal_Stm32n6_CrypAesCtr_Start    whal_AesCtr_Start
#define whal_Stm32n6_CrypAesCtr_Process  whal_AesCtr_Process
#endif
#ifdef WHAL_CFG_STM32N6_CRYP_GCM_DIRECT_API_MAPPING
#define whal_Stm32n6_CrypAesGcm_Oneshot  whal_AesGcm_Oneshot
#define whal_Stm32n6_CrypAesGcm_Start    whal_AesGcm_Start
#define whal_Stm32n6_CrypAesGcm_Process  whal_AesGcm_Process
#define whal_Stm32n6_CrypAesGcm_Finalize whal_AesGcm_Finalize
#endif
#ifdef WHAL_CFG_STM32N6_CRYP_GMAC_DIRECT_API_MAPPING
#define whal_Stm32n6_CrypAesGmac_Oneshot whal_AesGmac_Oneshot
#endif
#ifdef WHAL_CFG_STM32N6_CRYP_CCM_DIRECT_API_MAPPING
#define whal_Stm32n6_CrypAesCcm_Oneshot  whal_AesCcm_Oneshot
#define whal_Stm32n6_CrypAesCcm_Start    whal_AesCcm_Start
#define whal_Stm32n6_CrypAesCcm_Process  whal_AesCcm_Process
#define whal_Stm32n6_CrypAesCcm_Finalize whal_AesCcm_Finalize
#endif


/* ---- Init / Deinit ---- */

whal_Error whal_Stm32n6_Cryp_Init(whal_Crypto *dev)
{
    (void)dev;
    return WHAL_SUCCESS;
}

whal_Error whal_Stm32n6_Cryp_Deinit(whal_Crypto *dev)
{
    (void)dev;
    Disable(whal_Stm32n6_Cryp_Dev.base);
    ZeroKeyIv(whal_Stm32n6_Cryp_Dev.base);
    return WHAL_SUCCESS;
}

const whal_CryptoDriver whal_Stm32n6_Cryp_CryptoDriver = {
    .Init = whal_Stm32n6_Cryp_Init,
    .Deinit = whal_Stm32n6_Cryp_Deinit,
};


/* ---- AES-ECB ---- */

whal_Error whal_Stm32n6_CrypAesEcb_Oneshot(whal_AesEcb *dev,
                                           whal_Crypto_Dir dir,
                                           const void *key, size_t keySz,
                                           const void *in, void *out,
                                           size_t sz)
{
    const whal_Stm32n6_Cryp_Cfg *cfg =
        (const whal_Stm32n6_Cryp_Cfg *)whal_Stm32n6_Cryp_Dev.cfg;
    size_t base = whal_Stm32n6_Cryp_Dev.base;
    uint32_t keySizeBits;
    whal_Error err;
    (void)dev;

