wolfSSL/wolfHAL/src/crypto/stm32n6_cryp.c
    if (!key)
        return WHAL_EINVAL;

    err = KeySizeBits(keySz, &keySizeBits);
    if (err)
        return err;

    if (dir == WHAL_CRYPTO_DECRYPT) {
        err = PrepareDecryptionKey(base, key, keySz, keySizeBits,
                                   cfg->timeout);
        if (err)
            goto cleanup;
        ConfigureMode(base, CRYP_ALGOMODE_AES_ECB, CRYP_ALGODIR_DECRYPT,
                      keySizeBits, 0, 0, 0);
        Enable(base);
    } else {
        DisableAndFlush(base);
        ConfigureMode(base, CRYP_ALGOMODE_AES_ECB, CRYP_ALGODIR_ENCRYPT,
                      keySizeBits, 0, 0, 0);
        WriteKey(base, key, keySz);
        err = WaitKeyValid(base, cfg->timeout);
        if (err)
            goto cleanup;
        Enable(base);
    }

    err = Process_BlockCipher(in, out, sz);
cleanup:
    Disable(base);
    ZeroKeyIv(base);
    return err;
}

whal_Error whal_Stm32n6_CrypAesEcb_Start(whal_AesEcb *dev,
                                         whal_Crypto_Dir dir,
                                         const void *key, size_t keySz)
{
    const whal_Stm32n6_Cryp_Cfg *cfg =
        (const whal_Stm32n6_Cryp_Cfg *)whal_Stm32n6_Cryp_Dev.cfg;
    size_t base = whal_Stm32n6_Cryp_Dev.base;
    uint32_t keySizeBits;
    whal_Error err;
    (void)dev;

    if (!key)
        return WHAL_EINVAL;

    err = KeySizeBits(keySz, &keySizeBits);
    if (err)
        return err;

    if (dir == WHAL_CRYPTO_DECRYPT) {
        err = PrepareDecryptionKey(base, key, keySz, keySizeBits,
                                   cfg->timeout);
        if (err)
            goto cleanup;
        ConfigureMode(base, CRYP_ALGOMODE_AES_ECB, CRYP_ALGODIR_DECRYPT,
                      keySizeBits, 0, 0, 0);
        Enable(base);
    } else {
        DisableAndFlush(base);
        ConfigureMode(base, CRYP_ALGOMODE_AES_ECB, CRYP_ALGODIR_ENCRYPT,
                      keySizeBits, 0, 0, 0);
        WriteKey(base, key, keySz);
        err = WaitKeyValid(base, cfg->timeout);
        if (err)
            goto cleanup;
        Enable(base);
    }

    return WHAL_SUCCESS;

cleanup:
    Disable(base);
    ZeroKeyIv(base);
    return err;
}

whal_Error whal_Stm32n6_CrypAesEcb_Process(whal_AesEcb *dev,
                                           const void *in, void *out,
                                           size_t sz)
{
    (void)dev;
    return Process_BlockCipher(in, out, sz);
}

const whal_AesEcbDriver whal_Stm32n6_Cryp_EcbDriver = {
    .Oneshot = whal_Stm32n6_CrypAesEcb_Oneshot,
    .Start = whal_Stm32n6_CrypAesEcb_Start,
    .Process = whal_Stm32n6_CrypAesEcb_Process,
};


/* ---- AES-CBC ---- */

whal_Error whal_Stm32n6_CrypAesCbc_Oneshot(whal_AesCbc *dev,
                                           whal_Crypto_Dir dir,
                                           const void *key, size_t keySz,
                                           const void *iv,
                                           const void *in, void *out,
                                           size_t sz)
{
    const whal_Stm32n6_Cryp_Cfg *cfg =
        (const whal_Stm32n6_Cryp_Cfg *)whal_Stm32n6_Cryp_Dev.cfg;
    size_t base = whal_Stm32n6_Cryp_Dev.base;
    uint32_t keySizeBits;
    whal_Error err;
    (void)dev;

    if (!key || !iv)
        return WHAL_EINVAL;

    err = KeySizeBits(keySz, &keySizeBits);
    if (err)
        return err;

    if (dir == WHAL_CRYPTO_DECRYPT) {
        err = PrepareDecryptionKey(base, key, keySz, keySizeBits,
                                   cfg->timeout);
        if (err)
            goto cleanup;
        ConfigureMode(base, CRYP_ALGOMODE_AES_CBC, CRYP_ALGODIR_DECRYPT,
                      keySizeBits, 0, 0, 0);
        WriteIv16(base, (const uint8_t *)iv);
        Enable(base);
    } else {
        DisableAndFlush(base);
        ConfigureMode(base, CRYP_ALGOMODE_AES_CBC, CRYP_ALGODIR_ENCRYPT,
                      keySizeBits, 0, 0, 0);
        WriteIv16(base, (const uint8_t *)iv);
        WriteKey(base, key, keySz);
        err = WaitKeyValid(base, cfg->timeout);
        if (err)
            goto cleanup;
        Enable(base);
    }

    err = Process_BlockCipher(in, out, sz);
cleanup:
    Disable(base);
    ZeroKeyIv(base);
    return err;
}

whal_Error whal_Stm32n6_CrypAesCbc_Start(whal_AesCbc *dev,
                                         whal_Crypto_Dir dir,
                                         const void *key, size_t keySz,
                                         const void *iv)
{
    const whal_Stm32n6_Cryp_Cfg *cfg =
        (const whal_Stm32n6_Cryp_Cfg *)whal_Stm32n6_Cryp_Dev.cfg;
    size_t base = whal_Stm32n6_Cryp_Dev.base;
    uint32_t keySizeBits;
    whal_Error err;
    (void)dev;

    if (!key || !iv)
        return WHAL_EINVAL;

    err = KeySizeBits(keySz, &keySizeBits);
    if (err)
        return err;

    if (dir == WHAL_CRYPTO_DECRYPT) {
        err = PrepareDecryptionKey(base, key, keySz, keySizeBits,
                                   cfg->timeout);
        if (err)
            goto cleanup;
        ConfigureMode(base, CRYP_ALGOMODE_AES_CBC, CRYP_ALGODIR_DECRYPT,
                      keySizeBits, 0, 0, 0);
        WriteIv16(base, (const uint8_t *)iv);
        Enable(base);
    } else {
        DisableAndFlush(base);
        ConfigureMode(base, CRYP_ALGOMODE_AES_CBC, CRYP_ALGODIR_ENCRYPT,
                      keySizeBits, 0, 0, 0);
        WriteIv16(base, (const uint8_t *)iv);
        WriteKey(base, key, keySz);
        err = WaitKeyValid(base, cfg->timeout);
        if (err)
            goto cleanup;
        Enable(base);
    }

    return WHAL_SUCCESS;

cleanup:
    Disable(base);
    ZeroKeyIv(base);
    return err;
}

whal_Error whal_Stm32n6_CrypAesCbc_Process(whal_AesCbc *dev,
                                           const void *in, void *out,
                                           size_t sz)
{
    (void)dev;
    return Process_BlockCipher(in, out, sz);
}

const whal_AesCbcDriver whal_Stm32n6_Cryp_CbcDriver = {
    .Oneshot = whal_Stm32n6_CrypAesCbc_Oneshot,
    .Start = whal_Stm32n6_CrypAesCbc_Start,
    .Process = whal_Stm32n6_CrypAesCbc_Process,
};


/* ---- AES-CTR ---- */

