wolfSSL/wolfHAL/src/crypto/stm32n6_cryp.c
whal_Error whal_Stm32n6_CrypAesCtr_Oneshot(whal_AesCtr *dev,
                                           whal_Crypto_Dir dir,
                                           const void *key, size_t keySz,
                                           const void *iv,
                                           const void *in, void *out,
                                           size_t sz)
{
    const whal_Stm32n6_Cryp_Cfg *cfg =
        (const whal_Stm32n6_Cryp_Cfg *)whal_Stm32n6_Cryp_Dev.cfg;
    size_t base = whal_Stm32n6_Cryp_Dev.base;
    uint32_t keySizeBits;
    uint32_t algoDir;
    whal_Error err;
    (void)dev;

    if (!key || !iv)
        return WHAL_EINVAL;

    err = KeySizeBits(keySz, &keySizeBits);
    if (err)
        return err;

    algoDir = (dir == WHAL_CRYPTO_ENCRYPT) ? CRYP_ALGODIR_ENCRYPT
                                           : CRYP_ALGODIR_DECRYPT;

    DisableAndFlush(base);
    ConfigureMode(base, CRYP_ALGOMODE_AES_CTR, algoDir, keySizeBits, 0, 0, 0);
    WriteIv16(base, (const uint8_t *)iv);
    WriteKey(base, key, keySz);
    err = WaitKeyValid(base, cfg->timeout);
    if (err)
        goto cleanup;
    Enable(base);

    err = Process_BlockCipher(in, out, sz);
cleanup:
    Disable(base);
    ZeroKeyIv(base);
    return err;
}

whal_Error whal_Stm32n6_CrypAesCtr_Start(whal_AesCtr *dev,
                                         whal_Crypto_Dir dir,
                                         const void *key, size_t keySz,
                                         const void *iv)
{
    const whal_Stm32n6_Cryp_Cfg *cfg =
        (const whal_Stm32n6_Cryp_Cfg *)whal_Stm32n6_Cryp_Dev.cfg;
    size_t base = whal_Stm32n6_Cryp_Dev.base;
    uint32_t keySizeBits;
    uint32_t algoDir;
    whal_Error err;
    (void)dev;

    if (!key || !iv)
        return WHAL_EINVAL;

    err = KeySizeBits(keySz, &keySizeBits);
    if (err)
        return err;

    algoDir = (dir == WHAL_CRYPTO_ENCRYPT) ? CRYP_ALGODIR_ENCRYPT
                                           : CRYP_ALGODIR_DECRYPT;

    DisableAndFlush(base);
    ConfigureMode(base, CRYP_ALGOMODE_AES_CTR, algoDir, keySizeBits, 0, 0, 0);
    WriteIv16(base, (const uint8_t *)iv);
    WriteKey(base, key, keySz);
    err = WaitKeyValid(base, cfg->timeout);
    if (err)
        goto cleanup;
    Enable(base);

    return WHAL_SUCCESS;

cleanup:
    Disable(base);
    ZeroKeyIv(base);
    return err;
}

whal_Error whal_Stm32n6_CrypAesCtr_Process(whal_AesCtr *dev,
                                           const void *in, void *out,
                                           size_t sz)
{
    (void)dev;
    return Process_BlockCipher(in, out, sz);
}

const whal_AesCtrDriver whal_Stm32n6_Cryp_CtrDriver = {
    .Oneshot = whal_Stm32n6_CrypAesCtr_Oneshot,
    .Start = whal_Stm32n6_CrypAesCtr_Start,
    .Process = whal_Stm32n6_CrypAesCtr_Process,
};


/* ---- GCM helpers ---- */

/*
 * Run GCM init phase: configure CR for GCM, load IV (12 bytes + counter=2)
 * and key, then enable CRYP and wait for the hash subkey computation to
 * complete (CRYPEN auto-clears).
 */
static whal_Error GcmInit(const uint8_t *key, size_t keySz,
                          uint32_t keySizeBits, uint32_t algoDir,
                          const uint8_t *iv12)
{
    const whal_Stm32n6_Cryp_Cfg *cfg =
        (const whal_Stm32n6_Cryp_Cfg *)whal_Stm32n6_Cryp_Dev.cfg;
    size_t base = whal_Stm32n6_Cryp_Dev.base;
    whal_Error err;

    DisableAndFlush(base);
    ConfigureMode(base, CRYP_ALGOMODE_AES_GCM, algoDir, keySizeBits,
                  CRYP_GCM_CCMPH_INIT, 0, 0);
    whal_Reg_Write(base, CRYP_IV0LR_REG, whal_LoadBe32(iv12));
    whal_Reg_Write(base, CRYP_IV0RR_REG, whal_LoadBe32(iv12 + 4));
    whal_Reg_Write(base, CRYP_IV1LR_REG, whal_LoadBe32(iv12 + 8));
    whal_Reg_Write(base, CRYP_IV1RR_REG, 0x00000002UL);
    WriteKey(base, key, keySz);
    err = WaitKeyValid(base, cfg->timeout);
    if (err)
        return err;
    Enable(base);
    return WaitCrypEnClear(base, cfg->timeout);
}

/*
 * Feed AAD blocks during the header phase. The peripheral consumes header
 * data without producing output; the last partial block must be zero-padded.
 */
static whal_Error GcmHeaderPhase(const uint8_t *aad, size_t aadSz)
{
    const whal_Stm32n6_Cryp_Cfg *cfg =
        (const whal_Stm32n6_Cryp_Cfg *)whal_Stm32n6_Cryp_Dev.cfg;
    size_t base = whal_Stm32n6_Cryp_Dev.base;
    whal_Error err;
    size_t i;

    if (aadSz == 0)
        return WHAL_SUCCESS;

    whal_Reg_Update(base, CRYP_CR_REG, CRYP_CR_GCM_CCMPH_Msk,
                    whal_SetBits(CRYP_CR_GCM_CCMPH_Msk,
                                 CRYP_CR_GCM_CCMPH_Pos,
                                 CRYP_GCM_CCMPH_HEADER));
    Enable(base);

    for (i = 0; i < aadSz; i += 16) {
        size_t remain = aadSz - i;
        if (remain >= 16) {
            WriteBlock(base, aad + i);
        } else {
            uint8_t pad[16] = {0};
            size_t j;
            for (j = 0; j < remain; j++)
                pad[j] = aad[i + j];
            WriteBlock(base, pad);
        }
    }

    err = WaitBusyClear(base, cfg->timeout);
    if (err)
        return err;
    return WHAL_SUCCESS;
}


/* ---- AES-GCM ---- */

whal_Error whal_Stm32n6_CrypAesGcm_Oneshot(whal_AesGcm *dev,
                                           whal_Crypto_Dir dir,
                                           const void *key, size_t keySz,
                                           const void *iv, size_t ivSz,
                                           const void *aad, size_t aadSz,
                                           const void *in, void *out,
                                           size_t sz,
                                           void *tag, size_t tagSz)
{
    const whal_Stm32n6_Cryp_Cfg *cfg =
        (const whal_Stm32n6_Cryp_Cfg *)whal_Stm32n6_Cryp_Dev.cfg;
    size_t base = whal_Stm32n6_Cryp_Dev.base;
    uint32_t keySizeBits;
    uint32_t algoDir;
    uint8_t tagBuf[16];
    uint64_t aadBits;
    uint64_t payloadBits;
    whal_Error err;
    size_t i;
    (void)dev;

    if (!key || !iv)
        return WHAL_EINVAL;
    if (ivSz != 12)
        return WHAL_ENOTSUP;
    if (aadSz > 0 && !aad)
        return WHAL_EINVAL;
    if (sz > 0 && (!in || !out))
        return WHAL_EINVAL;
    if (!tag || tagSz == 0 || tagSz > 16)
        return WHAL_EINVAL;

    err = KeySizeBits(keySz, &keySizeBits);
    if (err)
        return err;

    algoDir = (dir == WHAL_CRYPTO_ENCRYPT) ? CRYP_ALGODIR_ENCRYPT
                                           : CRYP_ALGODIR_DECRYPT;

    /* Init phase */
    err = GcmInit((const uint8_t *)key, keySz,
                  keySizeBits, algoDir, (const uint8_t *)iv);
    if (err)
        goto cleanup;

    /* Header phase */
    err = GcmHeaderPhase((const uint8_t *)aad, aadSz);
    if (err)
        goto cleanup;

    /* Payload phase */
    if (sz > 0) {
        Disable(base);
        whal_Reg_Update(base, CRYP_CR_REG, CRYP_CR_GCM_CCMPH_Msk,
                        whal_SetBits(CRYP_CR_GCM_CCMPH_Msk,
                                     CRYP_CR_GCM_CCMPH_Pos,
                                     CRYP_GCM_CCMPH_PAYLOAD));
        Enable(base);

