wolfSSL/wolfHAL/src/crypto/stm32n6_cryp.c
        for (i = 0; i < sz; i += 16) {
            const uint8_t *inPtr = (const uint8_t *)in + i;
            uint8_t *outPtr = (uint8_t *)out + i;
            size_t remain = sz - i;
            uint8_t blockIn[16] = {0};
            uint8_t blockOut[16];
            size_t j;

            if (remain >= 16) {
                WriteBlock(base, inPtr);
            } else {
                if (dir == WHAL_CRYPTO_ENCRYPT) {
                    whal_Reg_Update(base, CRYP_CR_REG, CRYP_CR_NPBLB_Msk,
                                    whal_SetBits(CRYP_CR_NPBLB_Msk,
                                                 CRYP_CR_NPBLB_Pos,
                                                 16 - remain));
                }
                for (j = 0; j < remain; j++)
                    blockIn[j] = inPtr[j];
                WriteBlock(base, blockIn);
            }

            err = WaitOutputReady(base, cfg->timeout);
            if (err)
                goto cleanup;

            if (remain >= 16) {
                ReadBlock(base, outPtr);
            } else {
                ReadBlock(base, blockOut);
                for (j = 0; j < remain; j++)
                    outPtr[j] = blockOut[j];
            }
        }
    }

    /* Final phase */
    Disable(base);
    whal_Reg_Update(base, CRYP_CR_REG,
                    CRYP_CR_GCM_CCMPH_Msk | CRYP_CR_ALGODIR_Msk,
                    whal_SetBits(CRYP_CR_GCM_CCMPH_Msk,
                                 CRYP_CR_GCM_CCMPH_Pos,
                                 CRYP_GCM_CCMPH_FINAL));
    Enable(base);

    aadBits = (uint64_t)aadSz * 8;
    payloadBits = (uint64_t)sz * 8;
    whal_Reg_Write(base, CRYP_DINR_REG, (uint32_t)(aadBits >> 32));
    whal_Reg_Write(base, CRYP_DINR_REG, (uint32_t)aadBits);
    whal_Reg_Write(base, CRYP_DINR_REG, (uint32_t)(payloadBits >> 32));
    whal_Reg_Write(base, CRYP_DINR_REG, (uint32_t)payloadBits);

    err = WaitOutputReady(base, cfg->timeout);
    if (err)
        goto cleanup;

    ReadBlock(base, tagBuf);
    for (i = 0; i < tagSz; i++)
        ((uint8_t *)tag)[i] = tagBuf[i];

cleanup:
    Disable(base);
    ZeroKeyIv(base);
    return err;
}

whal_Error whal_Stm32n6_CrypAesGcm_Start(whal_AesGcm *dev,
                                         whal_Crypto_Dir dir,
                                         const void *key, size_t keySz,
                                         const void *iv, size_t ivSz,
                                         const void *aad, size_t aadSz)
{
    size_t base = whal_Stm32n6_Cryp_Dev.base;
    uint32_t keySizeBits;
    uint32_t algoDir;
    whal_Error err;
    (void)dev;

    if (!key || !iv)
        return WHAL_EINVAL;
    if (ivSz != 12)
        return WHAL_ENOTSUP;
    if (aadSz > 0 && !aad)
        return WHAL_EINVAL;

    err = KeySizeBits(keySz, &keySizeBits);
    if (err)
        return err;

    algoDir = (dir == WHAL_CRYPTO_ENCRYPT) ? CRYP_ALGODIR_ENCRYPT
                                           : CRYP_ALGODIR_DECRYPT;

    /* Init phase */
    err = GcmInit((const uint8_t *)key, keySz,
                  keySizeBits, algoDir, (const uint8_t *)iv);
    if (err)
        goto cleanup;

    /* Header phase */
    err = GcmHeaderPhase((const uint8_t *)aad, aadSz);
    if (err)
        goto cleanup;

    /* Transition to payload phase */
    Disable(base);
    whal_Reg_Update(base, CRYP_CR_REG, CRYP_CR_GCM_CCMPH_Msk,
                    whal_SetBits(CRYP_CR_GCM_CCMPH_Msk,
                                 CRYP_CR_GCM_CCMPH_Pos,
                                 CRYP_GCM_CCMPH_PAYLOAD));
    Enable(base);

    g_aesGcmState.aadSz = aadSz;
    g_aesGcmState.dataSz = 0;

    return WHAL_SUCCESS;

cleanup:
    Disable(base);
    ZeroKeyIv(base);
    return err;
}

whal_Error whal_Stm32n6_CrypAesGcm_Process(whal_AesGcm *dev,
                                           const void *in, void *out,
                                           size_t sz)
{
    const whal_Stm32n6_Cryp_Cfg *cfg =
        (const whal_Stm32n6_Cryp_Cfg *)whal_Stm32n6_Cryp_Dev.cfg;
    size_t base = whal_Stm32n6_Cryp_Dev.base;
    uint32_t algoDir;
    size_t i;
    whal_Error err;
    (void)dev;

    if (sz == 0)
        return WHAL_SUCCESS;

    if (!in || !out) {
        Disable(base);
        ZeroKeyIv(base);
        return WHAL_EINVAL;
    }

    algoDir = whal_GetBits(CRYP_CR_ALGODIR_Msk, CRYP_CR_ALGODIR_Pos,
                           whal_Reg_Read(base, CRYP_CR_REG));

    for (i = 0; i < sz; i += 16) {
        const uint8_t *inPtr = (const uint8_t *)in + i;
        uint8_t *outPtr = (uint8_t *)out + i;
        size_t remain = sz - i;
        uint8_t block[16] = {0};
        size_t j;

        if (remain >= 16) {
            WriteBlock(base, inPtr);
        } else {
            if (algoDir == CRYP_ALGODIR_ENCRYPT) {
                whal_Reg_Update(base, CRYP_CR_REG, CRYP_CR_NPBLB_Msk,
                                whal_SetBits(CRYP_CR_NPBLB_Msk,
                                             CRYP_CR_NPBLB_Pos,
                                             16 - remain));
            }
            for (j = 0; j < remain; j++)
                block[j] = inPtr[j];
            WriteBlock(base, block);
        }

        err = WaitOutputReady(base, cfg->timeout);
        if (err) {
            Disable(base);
            ZeroKeyIv(base);
            return err;
        }

        if (remain >= 16) {
            ReadBlock(base, outPtr);
        } else {
            ReadBlock(base, block);
            for (j = 0; j < remain; j++)
                outPtr[j] = block[j];
        }
    }

    g_aesGcmState.dataSz += sz;

    return WHAL_SUCCESS;
}

whal_Error whal_Stm32n6_CrypAesGcm_Finalize(whal_AesGcm *dev,
                                            void *tag, size_t tagSz)
{
    const whal_Stm32n6_Cryp_Cfg *cfg =
        (const whal_Stm32n6_Cryp_Cfg *)whal_Stm32n6_Cryp_Dev.cfg;
    size_t base = whal_Stm32n6_Cryp_Dev.base;
    uint8_t tagBuf[16];
    uint64_t aadBits;
    uint64_t payloadBits;
    size_t i;
    whal_Error err;
    (void)dev;

    if (!tag || tagSz == 0 || tagSz > 16) {
        Disable(base);
        ZeroKeyIv(base);
        return WHAL_EINVAL;
    }

    /* Final phase */
    Disable(base);
    whal_Reg_Update(base, CRYP_CR_REG,
                    CRYP_CR_GCM_CCMPH_Msk | CRYP_CR_ALGODIR_Msk,
                    whal_SetBits(CRYP_CR_GCM_CCMPH_Msk,
                                 CRYP_CR_GCM_CCMPH_Pos,
                                 CRYP_GCM_CCMPH_FINAL));
    Enable(base);

    aadBits = (uint64_t)g_aesGcmState.aadSz * 8;
    payloadBits = (uint64_t)g_aesGcmState.dataSz * 8;
    whal_Reg_Write(base, CRYP_DINR_REG, (uint32_t)(aadBits >> 32));
    whal_Reg_Write(base, CRYP_DINR_REG, (uint32_t)aadBits);
    whal_Reg_Write(base, CRYP_DINR_REG, (uint32_t)(payloadBits >> 32));
    whal_Reg_Write(base, CRYP_DINR_REG, (uint32_t)payloadBits);

    err = WaitOutputReady(base, cfg->timeout);
    if (err) {
        Disable(base);
        ZeroKeyIv(base);
        return err;
    }

    ReadBlock(base, tagBuf);
    for (i = 0; i < tagSz; i++)
        ((uint8_t *)tag)[i] = tagBuf[i];

