wolfSSL/wolfHAL/src/crypto/stm32n6_cryp.c
    Disable(base);
    ZeroKeyIv(base);
    return WHAL_SUCCESS;
}

const whal_AesGcmDriver whal_Stm32n6_Cryp_GcmDriver = {
    .Oneshot = whal_Stm32n6_CrypAesGcm_Oneshot,
    .Start = whal_Stm32n6_CrypAesGcm_Start,
    .Process = whal_Stm32n6_CrypAesGcm_Process,
    .Finalize = whal_Stm32n6_CrypAesGcm_Finalize,
};


/* ---- AES-GMAC ---- */

whal_Error whal_Stm32n6_CrypAesGmac_Oneshot(whal_AesGmac *dev,
                                            const void *key, size_t keySz,
                                            const void *iv, size_t ivSz,
                                            const void *aad, size_t aadSz,
                                            void *tag, size_t tagSz)
{
    const whal_Stm32n6_Cryp_Cfg *cfg =
        (const whal_Stm32n6_Cryp_Cfg *)whal_Stm32n6_Cryp_Dev.cfg;
    size_t base = whal_Stm32n6_Cryp_Dev.base;
    uint32_t keySizeBits;
    uint8_t tagBuf[16];
    uint64_t aadBits;
    whal_Error err;
    size_t i;
    (void)dev;

    if (!key || !iv)
        return WHAL_EINVAL;
    if (ivSz != 12)
        return WHAL_ENOTSUP;
    if (aadSz > 0 && !aad)
        return WHAL_EINVAL;
    if (!tag || tagSz == 0 || tagSz > 16)
        return WHAL_EINVAL;

    err = KeySizeBits(keySz, &keySizeBits);
    if (err)
        return err;

    /* Init phase */
    err = GcmInit((const uint8_t *)key, keySz,
                  keySizeBits, CRYP_ALGODIR_ENCRYPT,
                  (const uint8_t *)iv);
    if (err)
        goto cleanup;

    /* Header phase */
    err = GcmHeaderPhase((const uint8_t *)aad, aadSz);
    if (err)
        goto cleanup;

    /* Final phase */
    Disable(base);
    whal_Reg_Update(base, CRYP_CR_REG,
                    CRYP_CR_GCM_CCMPH_Msk | CRYP_CR_ALGODIR_Msk,
                    whal_SetBits(CRYP_CR_GCM_CCMPH_Msk,
                                 CRYP_CR_GCM_CCMPH_Pos,
                                 CRYP_GCM_CCMPH_FINAL));
    Enable(base);

    aadBits = (uint64_t)aadSz * 8;
    whal_Reg_Write(base, CRYP_DINR_REG, (uint32_t)(aadBits >> 32));
    whal_Reg_Write(base, CRYP_DINR_REG, (uint32_t)aadBits);
    whal_Reg_Write(base, CRYP_DINR_REG, 0);
    whal_Reg_Write(base, CRYP_DINR_REG, 0);

    err = WaitOutputReady(base, cfg->timeout);
    if (err)
        goto cleanup;

    ReadBlock(base, tagBuf);
    for (i = 0; i < tagSz; i++)
        ((uint8_t *)tag)[i] = tagBuf[i];

cleanup:
    Disable(base);
    ZeroKeyIv(base);
    return err;
}

const whal_AesGmacDriver whal_Stm32n6_Cryp_GmacDriver = {
    .Oneshot = whal_Stm32n6_CrypAesGmac_Oneshot,
};


/* ---- AES-CCM ---- */

/*
 * Build the 16-byte CCM B0 first authentication block from the user nonce,
 * tag length, and message length per NIST SP 800-38C Appendix A.
 */
static void CcmBuildB0(const uint8_t *nonce, size_t nonceSz, size_t tagSz,
                       size_t msgSz, int hasAad, uint8_t *b0)
{
    size_t q = 15 - nonceSz;
    size_t i;
    size_t msg = msgSz;

    b0[0] = (uint8_t)((hasAad ? 0x40 : 0) |
                      (((tagSz - 2) / 2) << 3) |
                      (q - 1));
    for (i = 0; i < nonceSz; i++)
        b0[1 + i] = nonce[i];
    for (i = 0; i < q; i++) {
        b0[15 - i] = (uint8_t)(msg & 0xFF);
        msg >>= 8;
    }
}

whal_Error whal_Stm32n6_CrypAesCcm_Oneshot(whal_AesCcm *dev,
                                           whal_Crypto_Dir dir,
                                           const void *key, size_t keySz,
                                           const void *nonce, size_t nonceSz,
                                           const void *aad, size_t aadSz,
                                           const void *in, void *out,
                                           size_t sz,
                                           void *tag, size_t tagSz)
{
    const whal_Stm32n6_Cryp_Cfg *cfg =
        (const whal_Stm32n6_Cryp_Cfg *)whal_Stm32n6_Cryp_Dev.cfg;
    size_t base = whal_Stm32n6_Cryp_Dev.base;
    uint32_t keySizeBits;
    uint32_t algoDir;
    uint8_t b0[16];
    uint8_t ctr0[16];
    uint8_t ctr1[16];
    uint8_t tagBuf[16];
    size_t q;
    size_t i;
    whal_Error err;
    (void)dev;

    if (!key || !nonce)
        return WHAL_EINVAL;
    if (nonceSz < 7 || nonceSz > 13)
        return WHAL_EINVAL;
    if (tagSz < 4 || tagSz > 16 || (tagSz & 1) != 0)
        return WHAL_EINVAL;
    if (aadSz > 0 && !aad)
        return WHAL_EINVAL;
    if (sz > 0 && (!in || !out))
        return WHAL_EINVAL;
    if (!tag)
        return WHAL_EINVAL;

    err = KeySizeBits(keySz, &keySizeBits);
    if (err)
        return err;

    algoDir = (dir == WHAL_CRYPTO_ENCRYPT) ? CRYP_ALGODIR_ENCRYPT
                                           : CRYP_ALGODIR_DECRYPT;

    q = 15 - nonceSz;
    CcmBuildB0((const uint8_t *)nonce, nonceSz, tagSz,
               sz, aadSz > 0, b0);

    /* CTR0 = B0 with the top-5 flag bits cleared and the message-length
     * bytes (last q bytes) zeroed. Replayed in the final phase below. */
    for (i = 0; i < 16; i++)
        ctr0[i] = b0[i];
    ctr0[0] &= 0x07;
    for (i = 16 - q; i < 16; i++)
        ctr0[i] = 0;

    /* CTR1 = CTR0 with bit 0 set (counter = 1). Per RM0486 Table 421 this
     * is what the IV registers receive at init time. */
    for (i = 0; i < 16; i++)
        ctr1[i] = ctr0[i];
    ctr1[15] |= 0x01;

    /* Init phase */
    DisableAndFlush(base);
    ConfigureMode(base, CRYP_ALGOMODE_AES_CCM, algoDir, keySizeBits,
                  CRYP_GCM_CCMPH_INIT, 0, 0);
    WriteIv16(base, ctr1);
    WriteKey(base, key, keySz);
    err = WaitKeyValid(base, cfg->timeout);
    if (err)
        goto cleanup;
    Enable(base);

    /* Feed B0 to start the CBC-MAC; CRYPEN auto-clears when init completes. */
    WriteBlock(base, b0);
    err = WaitCrypEnClear(base, cfg->timeout);
    if (err)
        goto cleanup;

    /* Header phase (AAD) */
    if (aadSz > 0) {
        const uint8_t *aadPtr = (const uint8_t *)aad;
        uint8_t hdr[16] = {0};
        size_t hdrOff;
        size_t aadOff = 0;

        whal_Reg_Update(base, CRYP_CR_REG, CRYP_CR_GCM_CCMPH_Msk,
                        whal_SetBits(CRYP_CR_GCM_CCMPH_Msk,
                                     CRYP_CR_GCM_CCMPH_Pos,
                                     CRYP_GCM_CCMPH_HEADER));
        Enable(base);

        hdr[0] = (uint8_t)(aadSz >> 8);
        hdr[1] = (uint8_t)aadSz;
        hdrOff = 2;
        while (hdrOff < 16 && aadOff < aadSz)
            hdr[hdrOff++] = aadPtr[aadOff++];
        WriteBlock(base, hdr);

        while (aadOff < aadSz) {
            uint8_t blk[16] = {0};
            size_t j;
            for (j = 0; j < 16 && aadOff < aadSz; j++)
                blk[j] = aadPtr[aadOff++];
            WriteBlock(base, blk);
        }

        err = WaitBusyClear(base, cfg->timeout);
        if (err)
            goto cleanup;
    }

    /* Payload phase */
    if (sz > 0) {
        Disable(base);
        whal_Reg_Update(base, CRYP_CR_REG, CRYP_CR_GCM_CCMPH_Msk,
                        whal_SetBits(CRYP_CR_GCM_CCMPH_Msk,
                                     CRYP_CR_GCM_CCMPH_Pos,
                                     CRYP_GCM_CCMPH_PAYLOAD));
        Enable(base);

