wolfSSL/wolfHAL/src/crypto/stm32n6_cryp.c
        for (i = 0; i < sz; i += 16) {
            const uint8_t *inPtr = (const uint8_t *)in + i;
            uint8_t *outPtr = (uint8_t *)out + i;
            size_t remain = sz - i;
            uint8_t blockIn[16] = {0};
            uint8_t blockOut[16];
            size_t j;

            if (remain >= 16) {
                WriteBlock(base, inPtr);
            } else {
                if (dir == WHAL_CRYPTO_DECRYPT) {
                    whal_Reg_Update(base, CRYP_CR_REG, CRYP_CR_NPBLB_Msk,
                                    whal_SetBits(CRYP_CR_NPBLB_Msk,
                                                 CRYP_CR_NPBLB_Pos,
                                                 16 - remain));
                }
                for (j = 0; j < remain; j++)
                    blockIn[j] = inPtr[j];
                WriteBlock(base, blockIn);
            }

            err = WaitOutputReady(base, cfg->timeout);
            if (err)
                goto cleanup;

            if (remain >= 16) {
                ReadBlock(base, outPtr);
            } else {
                ReadBlock(base, blockOut);
                for (j = 0; j < remain; j++)
                    outPtr[j] = blockOut[j];
            }
        }
    }

    /* Final phase */
    Disable(base);
    whal_Reg_Update(base, CRYP_CR_REG,
                    CRYP_CR_GCM_CCMPH_Msk | CRYP_CR_ALGODIR_Msk,
                    whal_SetBits(CRYP_CR_GCM_CCMPH_Msk,
                                 CRYP_CR_GCM_CCMPH_Pos,
                                 CRYP_GCM_CCMPH_FINAL));
    Enable(base);

    WriteBlock(base, ctr0);

    err = WaitOutputReady(base, cfg->timeout);
    if (err)
        goto cleanup;

    ReadBlock(base, tagBuf);
    for (i = 0; i < tagSz; i++)
        ((uint8_t *)tag)[i] = tagBuf[i];

cleanup:
    Disable(base);
    ZeroKeyIv(base);
    return err;
}

whal_Error whal_Stm32n6_CrypAesCcm_Start(whal_AesCcm *dev,
                                         whal_Crypto_Dir dir,
                                         const void *key, size_t keySz,
                                         const void *nonce, size_t nonceSz,
                                         const void *aad, size_t aadSz,
                                         size_t tagSz, size_t sz)
{
    const whal_Stm32n6_Cryp_Cfg *cfg =
        (const whal_Stm32n6_Cryp_Cfg *)whal_Stm32n6_Cryp_Dev.cfg;
    size_t base = whal_Stm32n6_Cryp_Dev.base;
    uint32_t keySizeBits;
    uint32_t algoDir;
    uint8_t b0[16];
    uint8_t ctr1[16];
    size_t q;
    size_t i;
    whal_Error err;
    (void)dev;

    if (!key || !nonce)
        return WHAL_EINVAL;
    if (nonceSz < 7 || nonceSz > 13)
        return WHAL_EINVAL;
    if (tagSz < 4 || tagSz > 16 || (tagSz & 1) != 0)
        return WHAL_EINVAL;
    if (aadSz > 0 && !aad)
        return WHAL_EINVAL;

    err = KeySizeBits(keySz, &keySizeBits);
    if (err)
        return err;

    algoDir = (dir == WHAL_CRYPTO_ENCRYPT) ? CRYP_ALGODIR_ENCRYPT
                                           : CRYP_ALGODIR_DECRYPT;

    q = 15 - nonceSz;
    CcmBuildB0((const uint8_t *)nonce, nonceSz, tagSz,
               sz, aadSz > 0, b0);

    for (i = 0; i < 16; i++)
        g_aesCcmState.ccmCtr0[i] = b0[i];
    g_aesCcmState.ccmCtr0[0] &= 0x07;
    for (i = 16 - q; i < 16; i++)
        g_aesCcmState.ccmCtr0[i] = 0;

    for (i = 0; i < 16; i++)
        ctr1[i] = g_aesCcmState.ccmCtr0[i];
    ctr1[15] |= 0x01;

    /* Init phase */
    DisableAndFlush(base);
    ConfigureMode(base, CRYP_ALGOMODE_AES_CCM, algoDir, keySizeBits,
                  CRYP_GCM_CCMPH_INIT, 0, 0);
    WriteIv16(base, ctr1);
    WriteKey(base, key, keySz);
    err = WaitKeyValid(base, cfg->timeout);
    if (err)
        goto cleanup;
    Enable(base);

    WriteBlock(base, b0);
    err = WaitCrypEnClear(base, cfg->timeout);
    if (err)
        goto cleanup;

    /* Header phase (AAD) */
    if (aadSz > 0) {
        const uint8_t *aadPtr = (const uint8_t *)aad;
        uint8_t hdr[16] = {0};
        size_t hdrOff;
        size_t aadOff = 0;

        whal_Reg_Update(base, CRYP_CR_REG, CRYP_CR_GCM_CCMPH_Msk,
                        whal_SetBits(CRYP_CR_GCM_CCMPH_Msk,
                                     CRYP_CR_GCM_CCMPH_Pos,
                                     CRYP_GCM_CCMPH_HEADER));
        Enable(base);

        hdr[0] = (uint8_t)(aadSz >> 8);
        hdr[1] = (uint8_t)aadSz;
        hdrOff = 2;
        while (hdrOff < 16 && aadOff < aadSz)
            hdr[hdrOff++] = aadPtr[aadOff++];
        WriteBlock(base, hdr);

        while (aadOff < aadSz) {
            uint8_t blk[16] = {0};
            size_t j;
            for (j = 0; j < 16 && aadOff < aadSz; j++)
                blk[j] = aadPtr[aadOff++];
            WriteBlock(base, blk);
        }

        err = WaitBusyClear(base, cfg->timeout);
        if (err)
            goto cleanup;
    }

    /* Transition to payload phase */
    Disable(base);
    whal_Reg_Update(base, CRYP_CR_REG, CRYP_CR_GCM_CCMPH_Msk,
                    whal_SetBits(CRYP_CR_GCM_CCMPH_Msk,
                                 CRYP_CR_GCM_CCMPH_Pos,
                                 CRYP_GCM_CCMPH_PAYLOAD));
    Enable(base);

    g_aesCcmState.aadSz = aadSz;
    g_aesCcmState.dataSz = 0;

    return WHAL_SUCCESS;

cleanup:
    Disable(base);
    ZeroKeyIv(base);
    return err;
}

whal_Error whal_Stm32n6_CrypAesCcm_Process(whal_AesCcm *dev,
                                           const void *in, void *out,
                                           size_t sz)
{
    const whal_Stm32n6_Cryp_Cfg *cfg =
        (const whal_Stm32n6_Cryp_Cfg *)whal_Stm32n6_Cryp_Dev.cfg;
    size_t base = whal_Stm32n6_Cryp_Dev.base;
    uint32_t algoDir;
    size_t i;
    whal_Error err;
    (void)dev;

    if (sz == 0)
        return WHAL_SUCCESS;

    if (!in || !out) {
        Disable(base);
        ZeroKeyIv(base);
        return WHAL_EINVAL;
    }

    algoDir = whal_GetBits(CRYP_CR_ALGODIR_Msk, CRYP_CR_ALGODIR_Pos,
                           whal_Reg_Read(base, CRYP_CR_REG));

