wolfSSL/wolfHAL/src/crypto/stm32n6_cryp.c
    for (i = 0; i < sz; i += 16) {
        const uint8_t *inPtr = (const uint8_t *)in + i;
        uint8_t *outPtr = (uint8_t *)out + i;
        size_t remain = sz - i;
        uint8_t block[16] = {0};
        uint8_t blockOut[16];
        size_t j;

        if (remain >= 16) {
            WriteBlock(base, inPtr);
        } else {
            if (algoDir == CRYP_ALGODIR_DECRYPT) {
                whal_Reg_Update(base, CRYP_CR_REG, CRYP_CR_NPBLB_Msk,
                                whal_SetBits(CRYP_CR_NPBLB_Msk,
                                             CRYP_CR_NPBLB_Pos,
                                             16 - remain));
            }
            for (j = 0; j < remain; j++)
                block[j] = inPtr[j];
            WriteBlock(base, block);
        }

        err = WaitOutputReady(base, cfg->timeout);
        if (err) {
            Disable(base);
            ZeroKeyIv(base);
            return err;
        }

        if (remain >= 16) {
            ReadBlock(base, outPtr);
        } else {
            ReadBlock(base, blockOut);
            for (j = 0; j < remain; j++)
                outPtr[j] = blockOut[j];
        }
    }

    g_aesCcmState.dataSz += sz;

    return WHAL_SUCCESS;
}

whal_Error whal_Stm32n6_CrypAesCcm_Finalize(whal_AesCcm *dev,
                                            void *tag, size_t tagSz)
{
    const whal_Stm32n6_Cryp_Cfg *cfg =
        (const whal_Stm32n6_Cryp_Cfg *)whal_Stm32n6_Cryp_Dev.cfg;
    size_t base = whal_Stm32n6_Cryp_Dev.base;
    uint8_t tagBuf[16];
    size_t i;
    whal_Error err;
    (void)dev;

    if (!tag || tagSz < 4 || tagSz > 16 || (tagSz & 1) != 0) {
        Disable(base);
        ZeroKeyIv(base);
        return WHAL_EINVAL;
    }

    /* Final phase */
    Disable(base);
    whal_Reg_Update(base, CRYP_CR_REG,
                    CRYP_CR_GCM_CCMPH_Msk | CRYP_CR_ALGODIR_Msk,
                    whal_SetBits(CRYP_CR_GCM_CCMPH_Msk,
                                 CRYP_CR_GCM_CCMPH_Pos,
                                 CRYP_GCM_CCMPH_FINAL));
    Enable(base);

    WriteBlock(base, g_aesCcmState.ccmCtr0);

    err = WaitOutputReady(base, cfg->timeout);
    if (err) {
        Disable(base);
        ZeroKeyIv(base);
        return err;
    }

    ReadBlock(base, tagBuf);
    for (i = 0; i < tagSz; i++)
        ((uint8_t *)tag)[i] = tagBuf[i];

    Disable(base);
    ZeroKeyIv(base);
    return WHAL_SUCCESS;
}

const whal_AesCcmDriver whal_Stm32n6_Cryp_CcmDriver = {
    .Oneshot = whal_Stm32n6_CrypAesCcm_Oneshot,
    .Start = whal_Stm32n6_CrypAesCcm_Start,
    .Process = whal_Stm32n6_CrypAesCcm_Process,
    .Finalize = whal_Stm32n6_CrypAesCcm_Finalize,
};
